# Working with tabular data using pandas
[Pandas](https://pandas.pydata.org/) is a library for processing and analysing tabular data.

## Loading data from disk
Load a csv file from disc and show it

In [1]:
import pandas as pd

data_frame = pd.read_csv('../data/Measurements_blobs_ImageJ.csv', delimiter=',')

# show it
data_frame

        Area     Mean  StdDev  Min  Max  Circ.     AR  Round  Solidity
0    1   433  190.855  30.305  128  232  0.630  2.075  0.482     0.860
1    2   185  179.286  21.883  128  224  0.763  1.778  0.562     0.951
2    3   658  205.617  29.381  128  248  0.872  1.068  0.936     0.967
3    4   434  217.327  36.061  128  248  0.884  1.064  0.940     0.959
4    5   477  212.143  29.904  128  248  0.821  1.570  0.637     0.968
..  ..   ...      ...     ...  ...  ...    ...    ...    ...       ...
59  60     1  128.000   0.000  128  128  1.000  1.000  1.000     1.000
60  61    81  183.407  34.682  128  248  0.567  3.082  0.324     0.910
61  62    90  181.511  25.599  128  216  0.461  4.095  0.244     0.933
62  63    53  188.377  38.799  128  248  0.527  2.859  0.350     0.891
63  64    49  172.898  28.743  128  224  0.456  4.277  0.234     0.883

[64 rows x 10 columns]

## Data selection
Select a column out of the table - or two!

In [2]:
data_frame["Round"]

0     0.482
1     0.562
2     0.936
3     0.940
4     0.637
      ...
59    1.000
60    0.324
61    0.244
62    0.350
63    0.234
Name: Round, Length: 64, dtype: float64

## Descriptive statistics

Determine the mean of a column

In [3]:
import numpy as np
np.mean(data_frame["Mean"])

187.72724999999997

Read out one particular cell of the table

In [4]:
data_frame["Mean"][0]

190.855

## Creating DataFrames
Make a new [DataFrame](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html) from scratch:

In [5]:
header = ['A', 'B', 'C']

data = [
    [1, 2, 3],  # this will later be colum A
    [4, 5, 6],  #                          B
    [7, 8, 9]   #                          C
]

# convert the data and header arrays in a pandas data frame
data_frame = pd.DataFrame(data, header)

# show it
data_frame

   0  1  2
A  1  2  3
B  4  5  6
C  7  8  9

In [6]:
# rotate/flip it
data_frame = data_frame.transpose()

# show it
data_frame

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

You can also create a DataFrame from a dictionary of arrays. Earlier, we called them tables.

In [7]:
# source: https://en.wikipedia.org/wiki/List_of_largest_cities
cities_table = {
    "City":       ['Tokyo',  'Delhi',  'Shanghai', 'Sao Paulo', 'Mexico City'],
    "Country": ['Japan',  'India',  'China',    'Brazil',    'Mexico'],
    "Population":    [13515271, 16753235, 24183000,   12252023,    9209944],
    "Area_km2":   [2191,     1484,     6341,       1521,        1485]
}

cities = pd.DataFrame(cities_table)
cities

          City Country  Population  Area_km2
0        Tokyo   Japan    13515271      2191
1        Delhi   India    16753235      1484
2     Shanghai   China    24183000      6341
3    Sao Paulo  Brazil    12252023      1521
4  Mexico City  Mexico     9209944      1485

## Selecting rows and columns
You can filter rows and columns from pandas DataFrames quite intuitively, [see also](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html).

Let's start by selecting two columns

In [8]:
cities[['City', 'Country']]

          City Country
0        Tokyo   Japan
1        Delhi   India
2     Shanghai   China
3    Sao Paulo  Brazil
4  Mexico City  Mexico

When analysing tabular data, it is often necessary to filter tables by selecting only rows which fulfill certain conditions. For example, we select large cities by area:

In [9]:
cities[cities['Area_km2'] > 2000]

       City Country  Population  Area_km2
0     Tokyo   Japan    13515271      2191
2  Shanghai   China    24183000      6341

How does this work? The inner square bracket returns a list of boolean `flags`, which select entries in the outer square brackets:

In [10]:
cities['Area_km2']

0    2191
1    1484
2    6341
3    1521
4    1485
Name: Area_km2, dtype: int64

In [11]:
flags = cities['Area_km2'] > 2000
flags

0     True
1    False
2     True
3    False
4    False
Name: Area_km2, dtype: bool

In [12]:
cities[flags]

       City Country  Population  Area_km2
0     Tokyo   Japan    13515271      2191
2  Shanghai   China    24183000      6341

## Adding columns
Sometimes, you want to compute parameters from other parameters and add them to the table. You can also add columns like this:

In [13]:
cities['Population per km2'] = (cities['Population'] / cities['Area_km2']).astype(int)
cities

          City Country  Population  Area_km2  Population per km2
0        Tokyo   Japan    13515271      2191                6168
1        Delhi   India    16753235      1484               11289
2     Shanghai   China    24183000      6341                3813
3    Sao Paulo  Brazil    12252023      1521                8055
4  Mexico City  Mexico     9209944      1485                6201

## Removing columns
You can use pythons [del](https://www.w3schools.com/python/ref_keyword_del.asp) cmmand to remove a column.

In [14]:
del cities['Population per km2']
cities

          City Country  Population  Area_km2
0        Tokyo   Japan    13515271      2191
1        Delhi   India    16753235      1484
2     Shanghai   China    24183000      6341
3    Sao Paulo  Brazil    12252023      1521
4  Mexico City  Mexico     9209944      1485

## Combining tables
In the mastery of data science you need to combine information from multiple tables. For example, to compute the relative population of a city with respect to the country it's in, you need to combine the `cities` DataFrame with the `Countries` DataFrame.

In [15]:
# source https://en.wikipedia.org/wiki/List_of_countries_by_population_(United_Nations)
countries_table = {
    'Country':    ['Japan',   'India',    'China',    'Brazil',  'Mexico'],
    'Population': [127202192, 1352642280, 1427647786, 209469323, 126190788]
}
countries = pd.DataFrame(countries_table)
countries

  Country  Population
0   Japan   127202192
1   India  1352642280
2   China  1427647786
3  Brazil   209469323
4  Mexico   126190788

For combining tables, we use the [join](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.join.html) function.

In [16]:
countries.merge(cities, on='Country')

  Country  Population_x         City  Population_y  Area_km2
0   Japan     127202192        Tokyo      13515271      2191
1   India    1352642280        Delhi      16753235      1484
2   China    1427647786     Shanghai      24183000      6341
3  Brazil     209469323    Sao Paulo      12252023      1521
4  Mexico     126190788  Mexico City       9209944      1485

The two population columns with _x and _y might be confusing. Thus, we can explicitly name them properly by providing a suffix.

In [17]:
combined = countries.merge(cities, on='Country', suffixes=['_country', '_city'])
combined

  Country  Population_country         City  Population_city  Area_km2
0   Japan           127202192        Tokyo         13515271      2191
1   India          1352642280        Delhi         16753235      1484
2   China          1427647786     Shanghai         24183000      6341
3  Brazil           209469323    Sao Paulo         12252023      1521
4  Mexico           126190788  Mexico City          9209944      1485

Just for fun, we compute the population ratio of the city in its country. For showing results nicely, remove all the other columns.

In [18]:
# compute ratio
combined['City_Country_population_ratio'] = combined['Population_city'] / combined['Population_country']

# only show selected columns
combined[['City', 'City_Country_population_ratio']]

          City  City_Country_population_ratio
0        Tokyo                       0.106250
1        Delhi                       0.012386
2     Shanghai                       0.016939
3    Sao Paulo                       0.058491
4  Mexico City                       0.072984

## Saving tables to disk
Saving tables to disk is trivial. Depending on the software you want to use for postprocessing, you nay want to specify separators (tabulator, comma, semicolon). See [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_csv.html) for details.

In [19]:
# save a dataframe to a CSV
cities.to_csv("output.csv")

## Exercise
Open `../data/Measurements_blobs_ImageJ.csv` and add a new column containing the perimeter of the objects. ([Hint](https://github.com/BiAPoL/Bio-image_Analysis_with_Python/blob/main/gpu_acceleration/00_GPU_acceleration_Quantitatve_measurements.pdf))